pivot()

In [1]:
import pandas as pd

In [3]:
var = pd.DataFrame(
    {
        "Days" : [1,2,3,4,5,6],
        "Name" : ["a", "b" ,"c","a", "b" ,"c" ],
        "English" : [10,12,13,14,15,15],
        "Maths" : [16,17,18,19,20,21],
    }
)
var

   Days Name  English  Maths
0     1    a       10     16
1     2    b       12     17
2     3    c       13     18
3     4    a       14     19
4     5    b       15     20
5     6    c       15     21

In [5]:
var.pivot(index = "Days" , columns = "Name")

     English             Maths
Name       a     b     c     a     b     c
Days
1       10.0   NaN   NaN  16.0   NaN   NaN
2        NaN  12.0   NaN   NaN  17.0   NaN
3        NaN   NaN  13.0   NaN   NaN  18.0
4       14.0   NaN   NaN  19.0   NaN   NaN
5        NaN  15.0   NaN   NaN  20.0   NaN
6        NaN   NaN  15.0   NaN   NaN  21.0

In [6]:
var.pivot(index = "Days" , columns = "Name",values ="English")

Name     a     b     c
Days
1     10.0   NaN   NaN
2      NaN  12.0   NaN
3      NaN   NaN  13.0
4     14.0   NaN   NaN
5      NaN  15.0   NaN
6      NaN   NaN  15.0

In [7]:
var = pd.DataFrame(
    {
        "Days" : [1,1,1,1,2,2],
        "Name" : ["a", "b" ,"a","a", "b" ,"b" ],
        "English" : [10,12,13,14,15,15],
        "Maths" : [16,17,18,19,20,21],
    }
)
var

   Days Name  English  Maths
0     1    a       10     16
1     1    b       12     17
2     1    a       13     18
3     1    a       14     19
4     2    b       15     20
5     2    b       15     21

In [ ]:
var.pivot_table(index="Name",columns="Days").mean